app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."uid" IS NULL
---
  def index
    @artworks = Artwork.where(uid: current_user.uid)

INSERT INTO "artworks" ("title", "price", "sold", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdfasdf"], ["price", 3], ["sold", true], ["created_at", "2018-09-09 21:04:17.145721"], ["updated_at", "2018-09-09 21:04:17.145721"]]
---
  def create
    @artwork = Artwork.create(artwork_params)
      .update(uid: current_user.uid)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @artwork = Artwork.find(params[:format])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "price" = $2, "sold" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", nil], ["price", nil], ["sold", nil], ["updated_at", "2018-08-10 22:24:31.522786"], ["id", 2]]
---
  def update
    @artwork = Artwork.find(params[:id])
    @artwork.update(
      title: params[:title],
      year: params[:year],
      medium: params[:medium],
      price: params[:price],
      description: params[:description],
      collection: params[:collection],
      location: params[:location],
      height: params[:height],
      width: params[:width],
      depth: params[:depth],
      sold: params[:sold],
    )

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]
---
  def delete
    @artwork = Artwork.find(params[:format])
    @artwork.destroy