app/controllers/omniauth_callbacks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["provider", "google_oauth2"], ["uid", "105643346293465383562"], ["LIMIT", 1]]
UPDATE "users" SET "remember_created_at" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["remember_created_at", "2018-09-09 21:00:33.217351"], ["updated_at", "2018-09-09 21:00:33.219955"], ["id", 2]]
---
  def google_oauth2
    auth = request.env['omniauth.auth']
    user = User.where(provider: auth['provider'], uid: auth['uid'])
               .first_or_initialize(email: auth['info']['email'], password: Devise.friendly_token[0, 20])
    user.save!